Revit 2027 API
UnitTypeId.TonnesCarbonDioxidePerKilowattHour Property
 tonnes of carbon dioxide per kWh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TonnesCarbonDioxidePerKilowattHour { get; }
Public Shared ReadOnly Property TonnesCarbonDioxidePerKilowattHour As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TonnesCarbonDioxidePerKilowattHour {
	ForgeTypeId^ get ();
}
static member TonnesCarbonDioxidePerKilowattHour : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace